In [1]:
# 조건으로 검색하기

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame(np.random.rand(5,2), columns=['A','B'])
df

          A         B
0  0.983693  0.252815
1  0.032190  0.360899
2  0.766172  0.308615
3  0.743091  0.942204
4  0.378729  0.489695

In [3]:
print(df['A'])
print()
print(df['A'] < 0.5)
print()
print(df[(df['A'] < 0.5) & (df['B'] > 0.3 )])
print()
print(df.query('A < 0.5 and B> 0.3'))

0    0.983693
1    0.032190
2    0.766172
3    0.743091
4    0.378729
Name: A, dtype: float64

0    False
1     True
2    False
3    False
4     True
Name: A, dtype: bool

          A         B
1  0.032190  0.360899
4  0.378729  0.489695

          A         B
1  0.032190  0.360899
4  0.378729  0.489695

In [4]:
condition = (df['A'] < 0.5) & (df['B'] > 0.3 )
df[condition]

          A         B
1  0.032190  0.360899
4  0.378729  0.489695

In [5]:
# 문자열 조건 검색

data = {
    'Animal' :['Dog','Cat','Cat','Pig', 'Cat'],
    'Name' : ['Happy','Sam','Tom','Mini','Rocky']
}
print(data)

{'Animal': ['Dog', 'Cat', 'Cat', 'Pig', 'Cat'], 'Name': ['Happy', 'Sam', 'Tom', 'Mini', 'Rocky']}

In [6]:
df = pd.DataFrame(data)
df.head()

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom
3    Pig   Mini
4    Cat  Rocky

In [7]:
df['Animal']

0    Dog
1    Cat
2    Cat
3    Pig
4    Cat
Name: Animal, dtype: object

In [8]:
# str.contains() 문자중에 검색하는 문자가 포함되어 있는지 확인
# 'Cat'이 포함 되어 있는지 boolean으로 나옴

df['Animal'].str.contains("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [9]:
# str.contains()와 같은 결과
df['Animal'].str.match("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [10]:
# 대소문자 상관없이 검색하려면 : case옵션 사용  
df['Animal'].str.contains("cat", case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [11]:
df['Animal'].str.match("cat", case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [12]:
df[df['Animal'].str.contains("Cat")]

  Animal   Name
1    Cat    Sam
2    Cat    Tom
4    Cat  Rocky

In [13]:
# 함수로 데이터 처리하기

df = pd.DataFrame(np.arange(5), columns=["num"])

In [14]:
# apply() : 함수를 받아서 적용함.
def square(x):
    return x**2

print(df)
print()
print(df['num'])
print()
print(df['num'].apply(square)) # 앞의 내용을 함수에 적용한다. 라는 뜻

   num
0    0
1    1
2    2
3    3
4    4

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [15]:
df['sqare'] = df['num'].apply(square)
print(df)

   num  sqare
0    0      0
1    1      1
2    2      4
3    3      9
4    4     16

In [16]:
df.num
# df['num'] 같음

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

In [17]:
df.num.apply(lambda x : x**2)

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [18]:
# 새 열 생성 >> 기존 데이터 프레임에 삽입
df['sqare_lambda'] = df.num.apply(lambda x : x**2)

print(df)

   num  sqare  sqare_lambda
0    0      0             0
1    1      1             1
2    2      4             4
3    3      9             9
4    4     16            16

In [19]:
# 함수로 데이터 처리하기

df = pd.DataFrame(columns= ['phone'])
df.loc[0] = '010-1234-5678'
df.loc[1] = '공일공-일이삼사-오육칠팔'
df.loc[2] = '010.1234.오육칠팔'
df.loc[3] = '공1공-1234-5육7팔'
df['preprocess_phone'] = ''
df

           phone preprocess_phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.오육칠팔
3  공1공-1234-5육7팔

In [20]:
def 전처리(phone):
    mapping = {
        '공' : '0',
        '일' : '1',
        '이' : '2',
        '삼' : '3',
        '사' : '4',
        '오' : '5',
        '육' : '6',
        '칠' : '7',
        '팔' : '8',
        '.' : '',
        '-' : '',
        ' ' : ''
    }
    for key, value in mapping.items():
        phone = phone.replace(key, value)
        
    return phone

In [21]:
df['preprocess_phone'] = df['phone'].apply(전처리)
df

           phone preprocess_phone
0  010-1234-5678      01012345678
1  공일공-일이삼사-오육칠팔      01012345678
2  010.1234.오육칠팔      01012345678
3  공1공-1234-5육7팔      01012345678

In [22]:
df

           phone preprocess_phone
0  010-1234-5678      01012345678
1  공일공-일이삼사-오육칠팔      01012345678
2  010.1234.오육칠팔      01012345678
3  공1공-1234-5육7팔      01012345678

In [23]:
# replace : apply기능에서 데이터 값만 대체하고 싶을 때 사용

data = {'0':'Male', '1' : 'Male', '2': 'Female', '3': 'Female', '4':'Male'}
data

{'0': 'Male', '1': 'Male', '2': 'Female', '3': 'Female', '4': 'Male'}

In [24]:
data_list = list(data.values())

In [25]:
df = pd.DataFrame(data_list, columns=['Sex'])

In [26]:
df.Sex.replace({"Male":0, "Female":1}, inplace=True)

C:\Users\taeyoung\AppData\Local\Temp\ipykernel_23236\1431310451.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Sex.replace({"Male":0, "Female":1}, inplace=True)
C:\Users\taeyoung\AppData\Local\Temp\ipykernel_23236\1431310451.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.Sex.replace({"Male":0, "Female":1}, inplace=True)

In [27]:
df

   Sex
0    0
1    0
2    1
3    1
4    0

In [28]:
# 그룹으로 묶기
# 조건부 집계하고 싶은 경우

df = pd.DataFrame({'key': ['A','B','C','A','B','C'],
              'data': range(6)
              })

In [29]:
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [30]:
df.groupby('key').sum() #key별로 묶어서 각 key별로 더해줘.

     data
key
A       3
B       5
C       7

In [31]:
df.groupby(['key','data']).sum()

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [32]:
# aggregate
# groupby 통해서 집계를 한번에 계산하고자 할 때

# 데이터 생성

data = {
    'group' : ['A','B','A','B','A','B','A','B'],
    'data1' : [20,30,40,20,30,40,30,50],
    'data2' : [1,2,3,4,5,6,7,8]
}
df = pd.DataFrame(data)

In [33]:
df

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [34]:
df.groupby('group').aggregate(['min', 'median', 'max'])

      data1            data2
        min median max   min median max
group
A        20   30.0  40     1    4.0   7
B        20   35.0  50     2    5.0   8

In [36]:
df.groupby('group').aggregate({'data1':'min', 'data2': 'sum'})

       data1  data2
group
A         20     16
B         20     20

In [38]:
# filter
# group by 통해 그룹으로 묶은 상태에서 그룹 속성을 기준으로 데이터를 필터링 함.

def filter_mean(x):
    return x['data2'].mean() > 3

print(df.groupby('group').mean())

       data1  data2
group
A       30.0    4.0
B       35.0    5.0

In [39]:
print(df.groupby('group').filter(filter_mean))

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [40]:
# apply
# groupby를 통해 묶인 데이터에 함수 적용

df.groupby('group').apply(lambda x: x.max()-x.min())

       data1  data2
group
A         20      6
B         30      6

In [42]:
df

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [41]:
# get_group
# groupby 로 묶인 데이터에서 key 값으로 데이터 가져오기

df.groupby('group').get_group('A')

  group  data1  data2
0     A     20      1
2     A     40      3
4     A     30      5
6     A     30      7

In [45]:
# Multi index
# index를 계층으로 구성함

import numpy as np

df=\
pd.DataFrame(
    np.random.randn(4,2),
    index = [['A','A','B','B'],[1,2,1,2]],
    columns = ['data1','data2']
)

In [50]:
df

        data1     data2
A 1 -1.210254 -0.044576
  2 -0.634626 -0.586089
B 1 -2.317921 -0.292129
  2  0.143370  0.351288

In [48]:
df_col = pd.DataFrame(
    np.random.randn(4,4),
    columns=[['A','A','B','B'],['1','2','1','2']]
)

In [49]:
df_col

          A                   B
          1         2         1         2
0 -0.156928  0.234057 -0.624851 -2.261525
1 -1.300121 -0.177410 -0.348130  1.614646
2  0.187930  1.860968  0.728281  1.319509
3 -0.237177  0.835386 -1.752137  0.513796

In [51]:
df_col['A']

          1         2
0 -0.156928  0.234057
1 -1.300121 -0.177410
2  0.187930  1.860968
3 -0.237177  0.835386

In [52]:
df_col['A']['1']

0   -0.156928
1   -1.300121
2    0.187930
3   -0.237177
Name: 1, dtype: float64

In [53]:
# pivot_table
# index : 행 index로 들어갈 key 
# column : 열 index로 라벨링 되는 값
# value : 분석할 데이터 값

df

        data1     data2
A 1 -1.210254 -0.044576
  2 -0.634626 -0.586089
B 1 -2.317921 -0.292129
  2  0.143370  0.351288

In [63]:
data = {
    "날짜": ["2020-01-01", "2020-01-01", "2020-01-01", "2020-01-02", "2020-01-02", "2020-01-02"],
    "카테고리": ["과일", "채소", "채소", "과일", "과일", "채소"],
    "수량": [10, 15, 5, 20, 10, 5],
    "판매처":['서울','부산','제주','서울','부산','제주']
}

In [64]:
df = pd.DataFrame(data)

df.pivot_table(
    index ='날짜',
    columns='카테고리',
    values ='수량',
    aggfunc='sum'
)

카테고리        과일  채소
날짜
2020-01-01  10  20
2020-01-02  30   5

In [75]:
df.pivot_table(
    index ='날짜',
    columns= ['카테고리','판매처'],
    values ='수량',
    aggfunc='mean',
    fill_value = 0
)

카테고리          과일          채소
판매처           부산    서울    부산   제주
날짜
2020-01-01   0.0  10.0  15.0  5.0
2020-01-02  10.0  20.0   0.0  5.0